# 10

In [4]:
import pandas as pd

In [8]:
df = pd.read_csv('../data/popular-names.txt', sep='\t', header=None)
print(len(df))
display(df)

2780

              0  1      2     3
0          Mary  F   7065  1880
1          Anna  F   2604  1880
2          Emma  F   2003  1880
3     Elizabeth  F   1939  1880
4        Minnie  F   1746  1880
...         ... ..    ...   ...
2775   Benjamin  M  13381  2018
2776     Elijah  M  12886  2018
2777      Lucas  M  12585  2018
2778      Mason  M  12435  2018
2779      Logan  M  12352  2018

[2780 rows x 4 columns]

In [1]:
!wc --lines ../data/popular-names.txt

2780 ../data/popular-names.txt

# 11

In [9]:
df.to_csv('../data/popular-names-space.txt',header=None,sep=' ')

# 12

In [14]:
df.loc[:,0].to_csv('../data/col1.txt',header=None, index=None)
df.loc[:,1].to_csv('../data/col2.txt',header=None, index=None)

# 13

In [22]:
df1 = pd.read_csv('../data/col1.txt',header=None)
df2 = pd.read_csv('../data/col2.txt',header=None)
df1_2 = pd.concat([df1,df2],axis=1)
display(df1_2)
df1_2.to_csv('../data/col1_2.txt', header=None, index=None, sep='\t')

              0  0
0          Mary  F
1          Anna  F
2          Emma  F
3     Elizabeth  F
4        Minnie  F
...         ... ..
2775   Benjamin  M
2776     Elijah  M
2777      Lucas  M
2778      Mason  M
2779      Logan  M

[2780 rows x 2 columns]

# 14

In [23]:
n = 5
print(df.head(n))

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880

# 15

In [24]:
print(df.tail(n))

             0  1      2     3
2775  Benjamin  M  13381  2018
2776    Elijah  M  12886  2018
2777     Lucas  M  12585  2018
2778     Mason  M  12435  2018
2779     Logan  M  12352  2018

# 16

In [30]:
lines = len(df)
# print(lines)
def split_files(df,n):
    lines_in_file = int(lines/n)
    print(lines_in_file*n)
    for i in range(n-1):
        df.iloc[i*lines_in_file,]
split_files(df,3)

2778